[
  {
    "id": 4,
    "startDate": "07/01/2022",
    "endDate": "12/31/2023",
    "company": "Applus+",
    "title": "Full Stack Developer",
    "description": [
      "Information System Integration: Conducted in-depth analysis and research to ensure seamless integration of information system projects into diverse laboratory environments.",
      "IT Support: Provided crucial IT support to laboratory teams, resolving technical issues promptly, and optimizing technology tools for enhanced productivity.",
      "Microservices Architecture Project Development: Led the design and development of a Microservices Architecture Project using FastAPI and .NET. Built a user-friendly Front End Application with NextJS, ReactJS, and TypeScript. Developed scalable React components with unit tests, stories, and factories for improved project modularity and maintainability.",
      "Azure Cloud Expertise: Utilized Azure’s cloud resources for efficient deployment, monitoring, and management of applications, ensuring high availability and reliability. Implemented Azure DevOps for streamlined CI/CD pipelines, enabling rapid development and deployment.",
      "Agile & Scrum Methodologies: Led a collaborative team that follows Agile and Scrum methodologies, ensuring efficient project management and timely results."
    ]
  },
  {
    "id": 3,
    "startDate": "07/01/2021",
    "endDate": "07/01/2022",
    "company": "Applus+",
    "title": "Full Stack Developer",
    "description": ["Led the creation of a web platform project hosted on a local network server, tailored to streamline project planning and coordination for laboratory teams.", "Involved in various critical functions within the platform, including data extraction of key information and user interface enhancements.", "Enhanced platform efficiency by leveraging a versatile array of programming languages, strategically optimizing functions to ensure smooth data distribution and efficient resource allocation."]
  },
  {
    "id": 2,
    "startDate": "02/01/2022",
    "endDate": "05/01/2022",
    "company": "Plink",
    "title": "Mobile Application Developer",
    "description": [
      "Work with cutting-edge technologies and best practices.",
      "Redux Architecture: Structured and managed the application's state using Redux, ensuring a seamless and efficient user experience.",
      "Webpack: I optimized the application's assets with Webpack, resulting in improved performance and faster load times.",
      "Scss/Sass: My proficiency in Scss/Sass allowed me to craft elegant and maintainable stylesheets, enhancing the overall aesthetics and user interface of the application.",
      "NodeJS: I leveraged NodeJS to build robust server-side components and ensure the backend operated smoothly.",
      "Linux skills and proficiency with Docker were instrumental in streamlining development workflows, maintaining consistency across environments, and facilitating rapid deployment."]
  },
  {
    "id": 1,
    "startDate": "06/01/2017",
    "endDate": "02/01/2020",
    "company": "Odournet",
    "title": "Technical Analyst",
    "description": ["Specialize in odor analysis and chemical data classification.", "The work involves studying complex chemical compositions to identify and categorize different smells. I help manage odor-related data, which is essential in various industries like fragrances and environmental monitoring."]
  }
]